{"content": "\nContent is constantly being updated and enhanced in this book as is the nature of wiki-based content. This book is therefore in a constant state of evolution. Any Wikibooks users can participate in helping this book to a better standard as both a reader, or a contributor.\n\nIf you are interested in reading the content present in this book, we encourage you to:\n\nshare comments about the technical accuracy, content, or organization of this book by telling the contributors in the Discussion section for each page. You can find the link Discussion on each page in this book leading you to appropriate sections for discussion. Leave a signature when providing feedback, writing comments, or giving suggestion on the Discussion pages. This can be achieved by appending -- ~~~~ to your messages. Do not add your signatures to the Book pages, they are only meant for the Discussion pages.\nshare news about the Java Programming Wikibook with your family and friends and let them know about this comprehensive Java guide online.\nbecome a contributing author, if you think that you have information that could fill in some missing gaps in this book.\nAs a contributor[edit]\nIf you are intent on writing content for this book, you need to do the following:\n\nWhen writing content for this book, you can always pose as an anonymous contributor, however we recommend you sign-in into the Wikibooks website when doing so. It becomes easier to track and acknowledge changes to certain parts of the book. Furthermore, the opinions and views of logged-in users are given precedence over anonymous users.\nOnce you have started contributing content for this book, make sure that you add your name to the contributor list.\nBe bold and try to follow the conventions for this Wikibook. It is important that the conventions for this book be followed to the letter to make content consistent and reliable throughout.\n\n\n Preface\n\nJava ProgrammingAbout This Book\n\nHistory \n", "heading": "How can you participate"}