{"content": " In order to make use of the content in this book, you would need to follow along each and every tutorial rather than simply reading through the book. But to do so, you would need access to a computer with the Java platform installed on it — the Java platform is the basic prerequisite for running and developing Java code, thus it is divided into two essential pieces of software:\n the Java Runtime Environment (JRE), which is needed to run Java applications and applets;\nthe Java Development Kit (JDK), which is needed to develop those Java applications and applets. However as a developer, you would only require the JDK which comes equipped with a JRE as well.\n As Java is just a programming language that allows you to program the computer, it has multiple implementations available. The most popular implementation of JDK and JRE are the \"Oracle Java SE\" (formerly known as Sun JDK), maintained by Oracle as a commercial release. However another similarly popular implementation is the OpenJDK, with the benefit of being free software that could distribute freely under GPL v2 without the requirement of accepting the \"Oracle Binary Code License Agreement for the Java SE Platform Products and JavaFX\". The third option - the GCJ, as part of the GNU Compiler Collection, would also supply the JDK and JRE.\n Given below are installation instruction for the Oracle Java SE JDK for various operating systems:\n Installation instructions for Windows\nAvailability check for JRE[edit]\nThe Java Runtime Environment (JRE) is necessary to execute Java programs. To check which version of Java Runtime Environment (JRE) you have, follow the steps below.\n\n\n\n\n\n\n1.\n\nFor Window Vista or Windows 7, click Start › Control Panel › System and Maintenance › System.\n\n\n\n\nFor Windows XP, click Start › Control Panel › System.\n\n\n\n\nFor Windows 2000, click Start › Settings › Control Panel › System.\n\n\n\n\nAlternatively, you can also press ⊞ Win+R to open the Run dialog. With the dialog open, type cmd at the prompt:\n Figure 1.1: Run dialog\n\n\n2.\n\nIn the command window with black background graced with white text, type the following command:\n\n\n\n\nJRE availability check\njava -version\n\n\nIf you get an error, such as:\n\n\n\n\n\nOther output error\nBad command or file name\n\n\n..then the JDK may not be installed or it may not be in your path.\n\n\nTo learn more about the Command Prompt syntax, take a look at this MS-DOS tutorial.\nYou may have other versions of Java installed; this command will only show the first in your PATH. You will be made familiar with the PATH environment variable later in this text. For now, if you have no idea what this is all about. Read through towards the end and we will provide you with a step-by-step guide on how to set your own environment variables.\nYou can use your system's file search utilities to see if there is a javac.exe executable installed. If it is, and it is a recent enough version (Java 1.4.2 or Java 1.5, for example), you should put the bin directory that contains javac in your system path. The Java runtime, java, is often in the same bin directory.\nIf the installed version is older (i.e. it is Java 1.3.1 or Java 1.4.2 and you wish to use the more recent Java 5 release), you should proceed below with downloading and installing a JDK.\nIt is possible that you have the Java runtime (JRE), but not the JDK. In that case the javac program won't be found, but the java -version will print the JRE version number.\n\nAvailability check for JDK[edit]\nSome Windows based systems come built-in with the JRE, however for the purposes of writing Java code by following the tutorials in this book, you would require the JDK nevertheless. The Java Development Kit (JDK) is necessary to build Java programs. First, check to see if a JDK is already installed on your system. To do so, first open a command window and execute the command below.\n\n\n\n\n\nAvailability check\njavac -version\n\n\nIf the JDK is installed and on your executable path, you should see some output which tells you the command line options. The output will vary depending on which version is installed and which vendor provided the Java installation.\n\nAdvanced availability check options on Windows platform[edit]\nOn a machine using the Windows operating system, one can invoke the Registry Editor utility by typing REGEDIT in the Run dialog. In the window that opens subsequently, if you traverse through the hierarchy HKEY_LOCAL_MACHINE > SOFTWARE > JavaSoft > Java Development Kit on the left-hand.\nThe resultant would be similar to figure 1.2, with the only exception being the version entries for the Java Development Kit. At the time of writing this manuscript, the latest version for the Java Development Kit available from the Internet was 1.7 as seen in the Registry entry. If you see a resultant window that resembles the one presented above, it would prove that you have Java installed on your system, otherwise it is not.\n\n Figure 1.2: Registry Editor\n\n\n\n\nCaution should be exercised when traversing through the Registry Editor. Any changes to the keys and other entries may change the way your Windows operating system normally works. Even minor changes may result into catastrophic failures of the normal working of your machine. Better that you don't modify or tend to modify anything whilst you are in the Registry Editor.\n\nDownload instructions[edit]\nTo acquire the latest JDK (version 7), you can manually download the Java software from the Oracle website.\nFor the convenience of our readers, the following table presents direct links to the latest JDK for the Windows operating system.\n\n\n\nOperating system\n\nSetup Installer\n\nLicense\n\n\nWindows x86\n\nDownload\n\nOracle Binary Code License Agreement\n\n\nWindows x64\n\nDownload\n\nOracle Binary Code License Agreement\n\nYou must follow the instructions for the setup installer wizard step-by-step with the default settings to ensure that Java is properly installed on your system. Once the setup is completed, it is highly recommended to restart your Windows operating system.\nIf you kept the default settings for the setup installer wizard, your JDK should now be installed at C:\\Program Files\\Java\\jdk1.7.0_01. You would require the location to your bin folder at a later time — this is located at C:\\Program Files\\Java\\jdk1.7.0_01\\bin It may be a hidden file, but no matter.  Just don't use Program Files (x86)\\ by mistake unless that's where the files were installed by Java.\n\nUpdating environment variables[edit]\nIn order for you to start using the JDK compiler utility with the Command Prompt, you would need to set the environment variables that points to the bin folder of your recently installed JDK. To set permanently your environment variables, follow the steps below.\n\n\n\n\n\n\n1.\n\nTo open System Properties dialog box use, the Control Panel or type the following command in the command window:\n\n\n\n\nSystem properties\nrundll32 shell32.dll,Control_RunDLL sysdm.cpl\n\n\n\n\n2.\n\nNavigate to the Advanced tab on the top, and select Environment Variables...\n\n\n3.\n\nUnder System variables, select the variable named Path and click Edit...\n\n\n4.\n\nIn the Edit System Variable dialog, go to the Variable value field. This field is a list of directory paths separated by semi-colons (;).\n\n\n5.\n\nTo add a new path, append the location of your JDK bin folder separated by a semi-colon (;).\n\n\n6.\n\nClick OK on every opened dialog to save changes and get past to where you started.\n\nStart writing code[edit]\nOnce you have successfully installed the JDK on your system, you are ready to program code in the Java programming language. However, to write code, you would need a decent text editor. Windows comes with a default text editor by default — Notepad. In order to use notepad to write code in Java, you need to follow the steps below:\n\n\n\n\n\n\n1.\n\nClick Start › All Programs › Accessories › Notepad to invoke the application.\n\n\n\n\nAlternatively, you can also press ⊞ Win+R to open the Run dialog. With the dialog open, type the following command at the prompt:\n\n\n\n\nNotepad launching\nnotepad\n\n\n\n\n2.\n\nOnce the Notepad application has fired up, you can use the editor to write code for the Java programming language.\n\n Installation instructions for GNU/Linux\nAvailability check for JRE[edit]\nThe Java Runtime Environment (JRE) is necessary to execute Java programs. To check which version of JRE you have, follow the steps below.\n\n\n\n\n\n\n1.\n\nOpen the Terminal window.\n\n\n2.\n\nType the following command:\n\n\n\n\nJRE availability check\njava -version\n\n\nIf you get something like this:\n\n\n\n\n\nOutput on a particular Kubuntu 12.10 installation, with OpenJDK as the provider of JDK and JRE\njava version \"1.7.0_09\"\nOpenJDK Runtime Environment (IcedTea7 2.3.3) (7u9-2.3.3-0ubuntu1~12.10.1)\nOpenJDK Client VM (build 23.2-b09, mixed mode, sharing)\n\n\n... then a JRE is installed. If you get an error, such as:\n\n\n\n\n\nOutput error\njava: command not found\n\n\n... then the JDK may not be installed or it may not be in your PATH.\n\n\nYou may have other versions of Java installed; this command will only show the first in your PATH. You will be made familiar with the PATH environment variable later in this text. For now, if you have no idea what this is all about, read through towards the end and we will provide you with a step-by-step guide on how to set your own environment variables.\nYou can use your system's file search utilities to see if there is a javac executable installed. If it is, and it is a recent enough version, you should put the bin directory that contains javac in your system PATH. The Java runtime, java, is often in the same bin directory.\nIf the installed version is older (i.e. it is Java 5 and you wish to use the more recent Java 7 release), you should proceed below with downloading and installing a JDK.\nIt is possible that you have the Java runtime (JRE), but not the JDK. In that case the javac program won't be found, but the java -version will print the JRE version number.\n\nAvailability check for JDK[edit]\nThe Java Development Kit (JDK) is necessary to build Java programs. For our purposes, you must use a JDK. First, check to see if a JDK is already installed on your system. To do so, first open a terminal window and execute the command below.\n\n\n\n\n\nAvailability check\njavac -version\n\n\nIf the JDK is installed and on your executable path, you should see some output which tells you the command line options. The output will vary depending on which version is installed and which vendor provided the Java installation.\n\nInstallation using Terminal[edit]\nDownloading and installing the Java platform on Linux machines is very easy and straight-forward. You have two choices to install the Java platforms: using a package manager such as DPKG/APT, YUM/RPM etc., or directly install them using the binary package. To use the terminal to download and install the Oracle Java SE platform, follow the instructions below.\n\n\n\n\n\n\n1.\n\nOpen the Terminal window.\n\n\n2.\n\nAt the prompt, type in the line followed by the name of your package manager as shown below:\n\n\n\n\nRetrieving the java packages\n# APT - Ubuntu, Linux Mint\n$ sudo add-apt-repository ppa:webupd8team/java\n$ sudo apt update\n$ sudo apt-get install oracle-java8-installer\n# APT - Debian, etc.\n$ echo \"deb http://ppa.launchpad.net/webupd8team/java/ubuntu xenial main\" | sudo tee /etc/apt/sources.list.d/webupd8team-java.list\n$ echo \"deb-src http://ppa.launchpad.net/webupd8team/java/ubuntu xenial main\" | sudo tee -a /etc/apt/sources.list.d/webupd8team-java.list\n$ sudo apt-key adv --keyserver hkp://keyserver.ubuntu.com:80 --recv-keys EEA14886\n$ sudo apt-get update\n$ sudo apt-get install oracle-java8-installer\n# Portage - Gentoo\n# You need to accept the license and fetch the source code manually from http://www.oracle.com/technetwork/java/javase/downloads/index.html\n#   and save it to /usr/portage/distfiles\n$ echo \"dev-java/oracle-jdk-bin Oracle-BCLA-JavaSE\" | sudo tee -a /etc/portage/package.license # Accept the Oracle License\n$ emerge oracle-jdk-bin\n\n\n\n\n3.\n\nAll Java softwares should be installed and instantly available now.\n\nDownload instructions[edit]\nAlternatively, you can manually download the Java software from the Oracle website.\nFor the convenience of our readers, the following table presents direct links to the latest JDK for the Linux operating system.\n\n\n\nOperating system\n\nRPM\n\nTarball\n\nLicense\n\n\nLinux x86\n\nDownload\n\nDownload\n\nOracle Binary Code License Agreement\n\n\nLinux x64\n\nDownload\n\nDownload\n\nOracle Binary Code License Agreement\n\nStart writing code[edit]\nThe most widely available text editor on GNOME desktops is Gedit, while on the KDE desktops, one can find Kate. Both these editors support syntax highlighting and code completion and therefore are sufficient for our purposes.\nHowever, if you require a robust and standalone text-editor like the Notepad++ editor on Windows, you would require the use of the minimalistic editor loaded with features – SciTE. Follow the instructions below if you wish to install SciTE:\n\n\n\n\n\n\n1.\n\nOpen the Terminal window.\n\n\n2.\n\nAt the prompt, write the following:\n\n\n\n\nRetrieving the java packages\n$ sudo apt-get install scite\n\n\n\n\n3.\n\nYou should now be able to use SciTE for your programming needs. You may also want to try Geany. Installation instructions are similar to those for SciTE.\n\n Installation instructions for Mac OS\nOn Mac OS, both the JRE and the JDK are already installed. However, the version installed was the latest version when the computer was purchased, so you may want to update it. \n\nUpdating Java for Mac OS[edit]\nGo to the Java download page.\nMechanically accept Oracle's license agreement.\nClick on the link for Mac OS X.\nRun the installer package.\nAvailability check for JDK[edit]\nThe Java Development Kit (JDK) is necessary to build Java programs. For our purposes, you must use a JDK. First, check to see if a JDK is already installed on your system. To do so, first open a terminal window and execute the command below.\n\n\n\n\n\nAvailability check\njava -version\n\n\nIf the JDK is installed and on your executable path, you should see some output which tells you the command line options. The output will vary depending on which version is installed and which vendor provided the Java installation.\n\n Installation instructions for Solaris\n\n\n\n\n\n\nTo do:Add a section describing the installation of Java onto Solaris machines. Incorporate some of the information provided in the commented section of this page.\n\n\n\n No Install Option for Programming Online\nIf you already have the JRE installed, you can use the Java Wiki Integrated Development Environment (JavaWIDE) to code directly in your browser, no account or special software required.\nClick here to visit the JavaWIDE Sandbox to get started.\nFor more information, click here to visit the JavaWIDE site.\n\n \n\n Getting started\n\nJava ProgrammingInstallation\n\nCompilation \n", "heading": "intro_Installation"}