{"content": "\nBy now, we thoroughly understand that any object can interact with its environment and in turn be influenced by it. In our example, the Animal object exposed certain fields – name and legs, and a method – walk() to be used by the environment to manipulate the object. This form of exposure is implicit. Using the Java programming language, a programmer has the power to define the level of access other objects and the environment have on a certain object.\n\nUsing access modifiers[edit]\nAlongside declaring and defining objects, their fields and methods, a programmer also has the ability to define the levels of access on those elements. This is done using keywords known as access modifiers.\n\nLet's modify our example to demonstrate this effect:\n\n\n\n\n\n\nclass Animal {\n\n  public String name;\n  public int legs;\n\n  public void walk() { }\n}\n\n\n\nBy declaring all fields and methods public, we have ensured that they can be used outside the scope of the Animal class. This means that any other object (other than Animal) has access to these member elements. However, to restrict access to certain member elements of a class, we can always use the private access modifier (as demonstrated below).\n\n\n\n\n\n\nclass Animal {\n\n  private String name;\n  private int legs;\n\n  public void walk() { }\n}\n\n\n\nIn this example, the fields name and legs can only be accessed within the scope of the Animal class. No object outside the scope of this class can access these two fields. However, since the walk() method still has public access, it can be manipulated by actors and objects outside the scope of this class. Access modifiers are not just limited to fields or methods, they can be used for class definitions as well (as is demonstrated below).\n\n\n\n\n\n\npublic class Animal {\n\n  private String name;\n  private int legs;\n\n  public void walk() { }\n}\n\n\n\nThe following list of keywords show the valid access modifiers that can be used with a Java program:\n\n\n\nkeyword\n\ndescription\n\n\npublic\n\nOpens access to a certain field or method to be used outside the scope of the class.\n\n\nprivate\n\nRestricts access to a certain field or method to only be used within the scope of the class.\n\n\nprotected\n\nAccess to certain field or methods is reserved for classes that inherit the current class.More on this would be discussed in the section on inheritance.\n\n\n\n The Java Platform\n\nJava ProgrammingGetting started\n\nInstallation \n", "heading": "The process of encapsulation"}